code/openfoam/tutorials/multicomponentFluid/membrane/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include"

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    $!sleeve/N2;

    zones
    {
        pipe
        {
            type        lookup;
            value       $!pipe/N2;
        }
    }
}

boundaryField
{
    inletSleeve
    {
        type            fixedValue;
        value           uniform $!sleeve/N2;
    }

    inletPipe
    {
        type            fixedValue;
        value           uniform $!pipe/N2;
    }

    outletSleeve
    {
        type            inletOutlet;
        inletValue      uniform $!sleeve/N2;
    }

    outletPipe
    {
        type            inletOutlet;
        inletValue      uniform $!pipe/N2;
    }

    wall
    {
        type            zeroGradient;
    }

    membraneSleeve
    {
        type            semiPermeableBaffleMassFraction;
        value           uniform $!sleeve/N2;
    }

    membranePipe
    {
        type            semiPermeableBaffleMassFraction;
        value           uniform $!pipe/N2;
    }
}


// ************************************************************************* //
